[
  {"text": "Olivia Chow is the current front-runner to be next mayor of Toronto — but even more Torontonians would cast their vote for former mayor John Tory if the election were held now, according to recent polls.", "label": "chow"},
  {"text": "Chow will be seeking to reverse her fortunes after coming a distant third in the 2014 mayoral race behind runner-up Doug Ford, who is now Ontario’s premier, and John Tory, who was elected to three terms.", "label": "chow"},
  {"text": "Chow announced her bid for the mayor’s chair on Monday, adding a highly recognizable name to the long list of candidates running in the byelection set for June 26.", "label": "chow"},
  {"text": "Chow announced her bid for the mayor’s chair on April 17, adding a highly recognizable name to the long list of candidates running in the by-election set for June 26.", "label": "chow"},
  {"text": "Chow has said she will focus on building a safe, affordable and caring Toronto since the city has become more expensive and less livable.", "label": "chow"},
  {"text": "Bailão, the former councillor for Davenport, says she has deep ties to labour.", "label": "bailao"},
  {"text": "Former city councillor Ana Bailao has confirmed to Global News she will be running for mayor of Toronto this June.", "label": "bailao"},
  {"text": "Bailao became a city councillor serving Toronto’s Davenport riding for 12 years, being first elected in 2010.", "label": "bailao"},
  {"text": "Ana Bailão is running for mayor.", "label": "bailao"},
  {"text": "But Bailão argued she would have a better chance than Tory of getting the province to agree if she gets voters’ backing for the upload proposal in this spring’s election.", "label": "bailao"},
  {"text": "Josh Matlow says he would invest tens of millions of dollars a year in order to restore TTC service to pre-pandemic levels if elected mayor of Toronto.", "label": "matlow"},
  {"text": "Matlow said he would pay for the restored service through his proposed City Works Fund — a dedicated property tax he says would cost the average homeowner $67 a year — and a proposed “climate action levy,” a parking lot levy targeting large businesses and corporations.", "label": "matlow"},
  {"text": "Matlow made the announcement Wednesday morning and said he would spend $180 million a year in order to restore service which was cut in the latest budget.", "label": "matlow"},
  {"text": "Toronto city councillor Josh Matlow is running for mayor on a promise to add a 2-per-cent special levy on the property tax bill to help fix struggling city services – and to be more combative with Premier Doug Ford.", "label": "matlow"},
  {"text": "Coun. Josh Matlow broke council’s code of conduct by criticizing two civil servants on social media and retaliated against one of them after she complained about his behaviour, Toronto’s integrity commissioner has found.", "label": "matlow"},
  {"text": "Mark Saunders’s mayoral bid has won the blessing of a popular Etobicoke councillor.", "label": "saunders"},
  {"text": "Former Toronto police chief Mark Saunders says he will run to be the city's next mayor, joining a crowded contest that now includes current and former councillors.", "label": "saunders"},
  {"text": "Saunders said the city needs to offer better services for those struggling with their mental health and homelessness. ", "label": "saunders"},
  {"text": "Saunders, the city's first and only Black police chief to date, served in the role from 2015 to 2020.", "label": "saunders"},
  {"text": "Saunders previously ran as a candidate for the Progressive Conservatives in 2022’s provincial election.", "label": "saunders"},
  {"text": "Toronto mayoral candidate Brad Bradford has released a four-point plan that he believes will make the TTC safer..", "label": "bradford"},
  {"text": "Bradford is one candidate in a very crowded field of mayoral hopefuls.", "label": "bradford"},
  {"text": "Brad Bradford, meanwhile, interviewed his own mother in a social post which finally cleared the air about how his name came to be.", "label": "bradford"},
  {"text": "Bradford recently revealed he had put together an advisory committee, including a number of political strategists, as he considers a run in the expected June election for mayor.", "label": "bradford"},
  {"text": "Vowing to be a “strong mayor of action” if elected, Coun. Brad Bradford is confirming his candidacy in the June 26 byelection to replace John Tory.", "label": "bradford"},
  {"text": "Seniors and Wheel-Trans users would ride the TTC for free if Mitzie Hunter is elected mayor, the mayoral candidate said Friday.", "label": "hunter"},
  {"text": "Four-term Liberal MPP Mitzie Hunter confirmed Thursday she will resign her seat at Queen's Park and run to be Toronto's next mayor.", "label": "hunter"},
  {"text": "First elected to represent the riding of Scarborough–Guildwood at the provincial level in 2013, Hunter went on to serve as the minister of education and associate minister of finance under former premier Kathleen Wynne.", "label": "hunter"},
  {"text": "Mayoral candidate Mitzie Hunter unveiled a plan Monday that would see the city bolster library services in a number of ways.", "label": "hunter"},
  {"text": "Hunter also ran for the Liberal leadership, ultimately losing to Stephen Del Duca.", "label": "hunter"}
]
