[
 {"text":"In its budget released late last month, the Progressive Conservatives pledged to spend $61.6 billion over 10 years for public transit, including on the Ontario Line in Toronto, expanding GO Transit from Oshawa to Bowmanville, the London GO Rail Service, which will provide weekday GO train trips between London and Union Station in Toronto.", "label":"pro transit"},
 {"text":"The New Democrats are pledging to spend $3.6 billion over four years on transit operations — they've earmarked $898 million per year to cover half of municipalities' transit operations.", "label":"pro transit"},
 {"text":"I recognize the vital role that public transit plays in connecting our communities, reducing traffic congestion, and improving the quality of life for our residents. I am committed to investing in modern, reliable, and accessible public transportation that serves the needs of all Torontonians, regardless of their income or location. By working together with our transit agencies and community partners, we can build a city that is more sustainable, equitable, and prosperous for everyone.", "label":"pro transit"},
 {"text":"Recognizing the needs of the constituents in her Toronto riding, she introduced legislation for universal child care and improving public transit.", "label":"pro transit"},
 {"text":"Toronto mayoral candidate Olivia Chow released her full campaign platform Friday with measures aimed at everything from improving transit to expanding the city's tree canopy.", "label":"pro transit"},
 {"text":"Brad Bradford and his family understand, firsthand, the challenges of finding a home in Toronto. For many, Toronto is just too expensive. ", "label":"pro housing"},
 {"text":"If we want a vibrant city that attracts and retains the best and brightest, we need to ensure there is housing available at every price point. The promise of Toronto is predicated on that idea that if you want to build your life here, we want to have you.", "label":"pro housing"},
 {"text":" That insight informs his plan to address the affordability crisis in this city by providing more housing for more people.", "label":"pro housing"},
 {"text":"There needs to be less talk about housing and more action to get it built, and Brad’s housing plan will do just that. Brad’s plan will:", "label":"pro housing"},
 {"text":"Provide safe housing to more people by introducing rapid shelters like sleeping pods and modular housing.", "label":"pro housing"},
 {"text":"We must stand up against the stabbings and the killings and the gun violence.", "label":"anti crime"},
 {"text":"Olivia promisses to adress the public's concern for safety.", "label":"anti crime"},
 {"text":"The safety of our public should be our number 1 priority.", "label":"anti crime"},
 {"text":"We should not tolerate kidnappings and stabbings ever.", "label":"anti crime"},
 {"text":"Marcus shows concern for the growing murder rate.", "label":"anti crime"},
 {"text":"Toronto's housing crisis has been made worse by the pandemic, and we need to take action to help people who are struggling to keep a roof over their heads. That's why I'm committed to working with all levels of government to provide affordable housing options for everyone in our city.", "label":"pro housing"},
 {"text":"As mayor, I will work tirelessly to make sure that every resident of our city feels safe and secure in their neighbourhoods. That means increasing police presence in high-crime areas, improving lighting and other safety measures, and investing in programs that help prevent crime from happening in the first place.", "label":"anti crime"},
 {"text":"Our transit system is outdated and overburdened", "label":"pro transit"},
  {"text": "Violent crime in our city is a serious problem that demands urgent attention from our leaders. We need to invest in community programs, hire more police officers, and implement tough sentencing laws to keep our neighborhoods safe.", "label": "anti crime"},
  {"text": "I fully support the Toronto Police Service and their efforts to reduce crime in our city. We need to work together to ensure that everyone feels safe in their homes and communities.", "label": "anti crime"},
  {"text": "Our government is committed to investing in public transit as a means of reducing traffic congestion and improving the quality of life for all residents. We will continue to prioritize projects that make it easier and more affordable for people to get around our city.", "label": "pro transit"},
  {"text": "I believe that public transit is a fundamental right and a key driver of economic growth. We need to invest in modern, reliable, and accessible public transportation systems that serve the needs of all residents, regardless of their income or location.", "label": "pro transit"},
  {"text": "Housing affordability is one of the most pressing issues facing our city today. We need to take bold action to increase the supply of affordable housing and ensure that everyone has a safe and secure place to call home.", "label": "pro housing"},
  {"text": "I believe that housing is a basic human right and that everyone deserves access to safe, affordable, and comfortable housing. We need to work together to create more affordable housing options for people of all incomes and backgrounds.", "label": "pro housing"},
  {"text": "We cannot tolerate hate crimes in our city. We need to send a strong message that discrimination and violence have no place in our communities and that we will not rest until everyone is treated with dignity and respect.", "label": "anti crime"},
  {"text": "Investing in public transit is a smart and necessary choice for our city. By improving access to transportation, we can reduce traffic congestion, improve air quality, and create new opportunities for economic growth and development.", "label": "pro transit"},
  {"text": "I believe that everyone deserves a place to call home. That's why I support measures to increase the supply of affordable housing, protect tenants' rights, and reduce homelessness in our city.", "label": "pro housing"},
  {"text": "We need to take a tough stance on crime in our city. By increasing police presence, investing in community programs, and implementing strong sentencing laws, we can send a clear message that criminal behavior will not be tolerated in our neighborhoods.", "label": "anti crime"},
  {"text": "Public transit is not just a convenience, it's a necessity. We need to invest in new transit projects and improve existing infrastructure to make it easier and more affordable for people to get around our city.", "label": "pro transit"},
  {"text": "I believe that housing should be a right, not a privilege. That's why I support initiatives to increase the supply of affordable housing, protect tenants' rights, and provide shelter and support to those experiencing homelessness.", "label": "pro housing"},
  {"text": "Violence has no place in our city. We need to take a strong stand against crime and invest in programs that promote peace, equality, and justice for all residents.", "label": "anti crime"},
  {"text": "Public transit is an essential service that connects people to jobs, education, and opportunity. We need to invest in new transit projects and ensure that everyone has access to affordable, reliable, and safe transportation options.", "label": "pro transit"},
  {"text": "We need to address the housing crisis in our city by providing more affordable housing options for all residents, regardless of income or background.", "label": "pro housing"},
  {"text": "The government must invest more in public transit to reduce traffic congestion and provide reliable transportation options for commuters.", "label": "pro transit"},
  {"text": "The recent rise in crime rates in our city is unacceptable. We must work together to improve community safety and reduce violence.", "label": "anti crime"},
  {"text": "As a city, we must prioritize the needs of our most vulnerable residents and ensure that everyone has access to safe and affordable housing.", "label": "pro housing"},
  {"text": "Investing in public transit is essential to reducing our carbon footprint and improving air quality in our city.", "label": "pro transit"},
  {"text": "We must take action to address the root causes of crime, such as poverty and lack of access to education and job opportunities.", "label": "anti crime"},
  {"text": "Expanding affordable housing options is crucial to building a more equitable and inclusive city.", "label": "pro housing"},
  {"text": "Improving public transit is key to promoting economic growth and increasing access to job opportunities.", "label": "pro transit"},
  {"text": "We cannot ignore the fact that crime rates are on the rise in our city. We must take action to make our communities safer for all residents.", "label": "anti crime"},
  {"text": "Everyone deserves a safe and affordable place to call home. We need to prioritize the development of affordable housing options in our city.", "label": "pro housing"},
  {"text": "Investing in public transit is not just about reducing traffic congestion - it's also about improving the quality of life for all residents by providing reliable transportation options.", "label": "pro transit"},
  {"text": "Community safety should be a top priority for all city officials. We must work together to reduce crime rates and promote a safer environment for everyone.", "label": "anti crime"},
  {"text": "Access to safe and affordable housing is a basic human right. We must do more to ensure that all residents have access to suitable housing options.", "label": "pro housing"},
  {"text": "The development of public transit infrastructure is crucial to reducing our reliance on cars and promoting more sustainable modes of transportation.", "label": "pro transit"},
  {"text": "We must address the root causes of crime if we want to create a safer and more just society for all.", "label": "anti crime"},
  {"text": "The lack of affordable housing options in our city is a crisis that must be addressed. We need to prioritize the development of more affordable housing options for all residents.", "label": "pro housing"},
  {"text": "Investing in public transit is not just about improving transportation options - it's also about creating jobs and stimulating economic growth.", "label": "pro transit"},
  {"text": "We cannot turn a blind eye to the rising crime rates in our city. We must work together to address the root causes of violence and promote community safety.", "label": "anti crime"},
  {"text": "Everyone deserves to feel safe in their own community. We must prioritize the development of programs and initiatives that promote community safety.", "label": "anti crime"},
  {"text": "Access to affordable housing is critical to reducing poverty and promoting economic mobility. We must prioritize the development of more affordable housing options in our city.", "label": "pro housing"}

]

